In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("titanic.csv")

In [3]:
df.head()

   PassengerId  Survived  Pclass  ... Cabin Embarked  Child
0            2         1       1  ...   C85        C      0
1            4         1       1  ...  C123        S      0
2            7         0       1  ...   E46        S      0
3           11         1       3  ...    G6        S      1
4           12         1       1  ...  C103        S      0

[5 rows x 13 columns]

In [4]:
df=df[["Survived","Pclass","Sex","Age","SibSp","Embarked","Child"]]

In [5]:
df.head()

   Survived  Pclass     Sex   Age  SibSp Embarked  Child
0         1       1  female  38.0      1        C      0
1         1       1  female  35.0      1        S      0
2         0       1    male  54.0      0        S      0
3         1       3  female   4.0      1        S      1
4         1       1  female  58.0      0        S      0

In [6]:
import sklearn

In [7]:
from sklearn import preprocessing

In [9]:
le=preprocessing.LabelEncoder()
df["Sex"]=le.fit_transform(df["Sex"])

In [10]:
df.head()

   Survived  Pclass  Sex   Age  SibSp Embarked  Child
0         1       1    0  38.0      1        C      0
1         1       1    0  35.0      1        S      0
2         0       1    1  54.0      0        S      0
3         1       3    0   4.0      1        S      1
4         1       1    0  58.0      0        S      0

In [11]:
le=preprocessing.LabelEncoder()
df["Embarked"]=le.fit_transform(df["Embarked"])

In [12]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Embarked  Child
0         1       1    0  38.0      1         0      0
1         1       1    0  35.0      1         2      0
2         0       1    1  54.0      0         2      0
3         1       3    0   4.0      1         2      1
4         1       1    0  58.0      0         2      0

In [13]:
X=df.drop("Survived", axis=1)
Y=df["Survived"]

In [14]:
from sklearn.model_selection import train_test_split

In [15]:
X_train, X_test, y_train, y_test=train_test_split(X,Y)

In [16]:
from sklearn.neighbors import KNeighborsClassifier

In [18]:
model=KNeighborsClassifier(n_neighbors=3)
model.fit(X_train, y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=3, p=2,
                     weights='uniform')

In [19]:
y_prdicted=model.predict(X_test)

In [20]:
from sklearn.metrics import accuracy_score

In [22]:
print(accuracy_score(y_prdicted, y_test)*100)

80.43478260869566